function Dsp() 
{ 
this.Items = {}; 
} 
Dsp.prototype.add = function(id,iArray) 
{ 
this.Items[id] = iArray; 
} 
Dsp.prototype.Exists = function(id) 
{ 
if(typeof(this.Items[id]) == "undefined") return false; 
return true; 
}

function change(v){ 
	var str="0"; 
	for(i=0;i<v;i++){
		str+=("_"+(document.getElementById(s[i]).selectedIndex-1));
	}; 
	var ss=document.getElementById(s[v]); 
	with(ss){ 
		length = 0; 
		options[0]=new Option(opt0[v],opt0[v],opt0[v]); 
		if(v && document.getElementById(s[v-1]).selectedIndex>0 || !v) 
		{ 
			if(dsp.Exists(str)){ 
			ar = dsp.Items[str]; 
			for(i=0;i<ar.length;i++)
				options[length]=new Option(ar[i],ar[i],ar[i]); 
			if(v)options[1].selected = true; 
			} 
		} 
		if(++v<s.length){
			change(v);
		} 
	} 
}

var dsp = new Dsp();

dsp.add("0",["旅游签证","商务签证","探亲签证"]);
/*旅游签证开始*/
dsp.add("0_0",["亚洲","欧洲","美洲","非洲","大洋洲"]); 
dsp.add("0_0_0",["日本","印尼","老挝","缅甸","韩国","泰国","菲律宾","斯里兰卡","柬埔寨","马来西亚","新加坡","尼泊尔","越南","印度","以色列","中国台湾(入台证)","阿联酋","孟加拉","伊朗","巴林","马尔代夫","东帝汶","黎巴嫩","阿塞拜疆","格鲁吉亚","文莱"]);
dsp.add("0_0_1",["爱沙尼亚","比利时","摩纳哥","瑞典","瑞士","匈利亚","爱尔兰","奥地利","冰岛","波兰","大溪地","丹麦","德国","法国","芬兰","荷兰","捷克","葡萄牙","俄罗斯","拉脱维亚","斯洛文尼亚","土耳其","西班牙","希腊","意大利","英国"]);
dsp.add("0_0_2",["加拿大","美国","墨西哥","哥伦比亚","巴西","古巴","海地"]);
dsp.add("0_0_3",["南非","埃及","肯尼亚","赞比亚","马达加斯加","纳米比亚","埃塞俄比亚","喀麦隆"]);
dsp.add("0_0_4",["澳大利亚","新西兰","斐济"]);
/*旅游签证结束*/
/*商务签证开始*/
dsp.add("0_1",["亚洲","欧洲","美洲","非洲","大洋洲"]);

dsp.add("0_1_0",["日本","印度","缅甸","泰国","柬埔寨","蒙古","马来西亚","越南","新加坡","印尼","巴基斯坦","以色列","韩国","哈萨卡斯坦","伊朗","伊拉克","沙特阿拉伯","乌兹别卡斯坦","卡塔尔","吉尔吉斯斯坦","约旦"]);
dsp.add("0_1_1",["意大利","荷兰","爱尔兰","葡萄牙","瑞典","匈牙利","芬兰","丹麦","波兰","奥地利","比利时","德国","法国","瑞士","西班牙","希腊","英国","爱沙尼亚","保加利亚","捷克","拉脱维亚","斯洛文尼亚","乌克兰","大溪地","摩纳哥","冰岛","卢森堡","立陶宛","斯洛伐克","罗马尼亚","土耳其"]);
dsp.add("0_1_2",["加拿大","美国","墨西哥","哥伦比亚","巴西","古巴","秘鲁","智利","阿根廷","厄瓜多尔","乌拉哇"]);
dsp.add("0_1_3",["南非","埃及","肯尼亚","赞比亚","纳米比亚","喀麦隆","加纳","尼日利亚","坦桑尼亚","利比亚","突尼斯","摩洛哥","苏丹"]);
dsp.add("0_1_4",["澳大利亚","新西兰"]);

/*探亲签证开始*/
dsp.add("0_2",["欧洲","美洲","非洲","大洋洲","亚洲"]);

dsp.add("0_2_0",["法国","意大利","德国","荷兰","爱尔兰","奥地利","葡萄牙","匈牙利","芬兰","丹麦","波兰","瑞士","西班牙","希腊","英国","比利时","爱沙尼亚","捷克","冰岛","拉脱维亚","卢森堡","斯洛伐克"]);
dsp.add("0_2_1",["加拿大","美国","巴西","智利"]);
dsp.add("0_2_2",["南非"]);
dsp.add("0_2_3",["澳大利亚","新西兰"]);
dsp.add("0_2_4",["日本"]);

var s=["super1","super2","super3"]; 
var opt0 = ["留学签证","哪个大洲","国家"]; 
function setupvisa() 
{ 
	for(i=0;i<s.length-1;i++) 
	document.getElementById(s[i]).onchange=new Function("change("+(i+1)+")"); 
	change(0); 
}